HELLO_LIST = [
    "よろしく！",
    "よろしくお願いします。",
    "よろでーす",
    "こんにちは！！",
    "お手柔らかに",
    "おはようございます。",
    "はじめまして！お願いします！！",
    "みんなをスタァライトしちゃいます！！！",
    "皆殺しのレヴューの開演です！！",
    "人狼だれですか（笑）",
    "初めまして!",
    "楽しみです！",
    "楽しみ",
    "人狼初めてです。全然わかりません。",
    "人狼さん噛まないで :pien:",
    "よろしく！",
    "よろしくお願いします。",
    "よろでーす",
    "よろしく！",
    "よろしくお願いします。",
    "よろでーす",
    "よろしく！",
    "よろしくお願いします。",
    "よろでーす",
    "こんにちは！！",
    "お手柔らかに",
    "おはようございます。",
    "はじめまして！よろしくお願いします！！",
    "よろしくwwww",
    "あたしもひかりに負けたくない",
    "負けたくない",
    "負けないぞw",
    "人狼歴3分です. よろしくお願いします。",
    "よろしく",
    "対戦お願いします。",
    "Hi!",
    "Hello!",
    "Hello World!",
    "おはよう",
    "おはよう(-_-)",
    "Hello nice to meet you",
    "村人です。よろしく",
]

SECOND_CHAT = [
    "だれか人狼経験者いますか?",
]

VOTE_UTTER_LIST = [
    "投票先は_targetにします",
    "_targetに投票で",
    "_targetに投票します～",
    "_targetに投票でおねがいします",
    "_targetに投票します!",
    "_targetに投票します",
    "_targetに投票",
    "_targetが人狼だと思うので投票します",
]

SEER_UTTER_LIST_DAY1 = [
    "占い師です。結果は、_targetが_resultでした",
    "占い師COします! _targetが_resultです。",
    "占い師だけど, _target_resultだった",
    "占い師でした。結果は_targetが_result",
    "本物の占い師です！_targetを占った結果, _resultでした.",
    "占い師です。_targetが_resultでした",
    "占い師です！結果は、_targetが_resultでした",
    "占い師です！_targetが_resultです。",
    "占い師です！, _targetが_resultだったよ",
    "占い師です！結果は_targetが_result",
    "占い師です！_targetが_resultでした",
    "占い師です. _targetを占った結果, _resultでした.",
]

SEER_RESULT_REQ_LIST = [
    "占い師COしてね～～",
    "占い師COした？",
    "占い師でて",
    "占い師でてね",
    "占い師CO please",
    "占い師はだれですか？",
    "おなかすいた",
    "私は人狼ではないです.",
    "レヴュースタァライトってアニメめっちゃおすすめ",
    "人狼は>>Agent[01]だと思う",
    "人狼は>>Agent[02]だと思う",
    "人狼は>>Agent[03]だと思う. 勘だけど",
    "人狼は>>Agent[04]だと思う",
    "人狼は>>Agent[05]だと思う",
    "人狼さん噛まないで(> <)",
]

SEER1_ACK_LIST = [
    "占い師_seer把握. _targetが_resultも把握",
    "_seerが占い師、_targetが_result把握",
    "_seer占い師把握. _targetが_result把握. 占い対抗いたらでてね",
    "占い結果把握しました！！",
    "占い師と占い結果把握です",
    "【占い師把握】君が占い師だったなんて意外だね",
    "_seer、占い師だったのかよwww",
    "_targetが_result把握ですわ～～～～",
    "占い師から吊るのはなしだよね？",
]
SEER2_ACK_LIST = [
    "占い師(仮)が_seer1と_seer2把握, _target1が_result1, _target2が_result2も把握",
    "_seer1, _seer2が占い師把握. _target1_result1 _target2_result2把握",
    "占い結果把握しました！！",
    "占い師と占い結果把握です",
    "【占い師把握】君たちが占い師だったなんて意外だね",
    "_seer2、占い師だったのかよwww",
    "_target1が_result, _target2が_result2把握ですわ～～～～",
    "占い師COのどっちかは狂人ってこと？？",
    "占い師の片方に狂人がおるのか",
    "占い師から吊るのはなしだよね？",
    "_seer2は狂人な気がしている",
    "_seer1、狂人なのでは??_seer2が本物っぽい",
    "占い師が出そろったようだね, さてさて誰を吊るかを決めようジャマイカ",
    "占い師のうち, どっちかが人狼って線はない？？",
]

SEER1_ACK_LIST_WEREWOLF = [
    "_targetが人狼なんだから、そいつを吊れば終わるよ",
    "_targetが黒か、じゃあ村勝ったね",
    "とりあえず、黒判定出てる_targetを吊ろう",
    "_targetを吊りましょう",
    ">>_target 何か言い残すことはある？？",
    ">>_target 人狼め～～～",
    "黒吊りでおけ、平和な村だったね！！",
    "もう話すことはなさそう",
    ">>_target これは運が無かったね",
]

WEREWOLF_DENY = [
    "違うぞ、私は人狼ではない",
    "やばくないか、人狼じゃないんだけど",
    "本当に私は人狼じゃないです",
    "人狼は別にいるはず例えば _agentとか",
    "村人陣営の自分に黒だししてきた_seerが一番怪しいと思いますよ。私目線では。",
    "違うんだけど",
    "本当に黒じゃないぞ",
    "私は占い師です. 占い結果は_seerが黒でした",
    "私は本当は占い師で、結果は_seerが黒でした",
    "人狼じゃなくて占い師なんだけど, 結果は_seerが黒だって",
]

SEER2_ACK_LIST_WEREWOLF = [
    "両方黒出しされたのか。。とりあえずロラでおけ",
    "黒をローラーしましょう",
    "_target1が怪しいのでそっちを先で",
    "_target2が怪しいのでそっちを先に吊りましょうよ",
    "_target1と_target2のどっちかを吊りましょう",
    "_target1か_target2のどちらを吊るかを決めておきたいですね",
]

GRAY_LIST = [
    "いまグレーなのってだれだっけ",
    "グレランでいいと思います",
]

SEER_UTTER_LIST_DAY2 = [
    "今日の占い結果は、_targetが_resultでした",
    "_targetが_resultです。",
    "_target_resultだった",
    "_targetが_result",
    "_targetを占った結果, _resultでした.",
    "_targetが_resultでした",
]

SEER1_DAY2_ACK = [
    "_target _result 把握です",
    "_targetが_result",
    "占い結果把握",
    "占い結果おけ",
    "占い結果了解いたした",
    "_target が_resultね。りょうかーい",
]

SEER1_DAY2_REQ = [
    ">>_seer 占い結果は？",
    ">>_seer 占い結果の共有をお願いします",
    ">>_seer 占いよろ",
    "占い結果は？>>_seer",
    "占い結果よろでーす",
    "占い結果あくしろ",
    "占い師生きてる？",
    "占い師生存キタコレ！！",
    "占い師生き残ってるじゃん。よかった",
    "占い師生きてる！！！！>>_seer",
]

SEER1_DAY2_DEAD = [
    "占い師死亡のお知らせ",
    "【悲報】占い師死亡www",
    "占い師がいないんじゃだれを吊ればいいかわからないじゃないか",
    "だれか占い師を生き返らせてくれーーーー",
    "誰吊る？",
    ">>_seer 死んでる",
    "お願い～よ>>_seer 目を覚～ま～し～て～",
    "占い師がアタシ再生産してくれればよし",
    "スタァライトのオタクおって草",
    "スタァライトはいいぞ",
]

SEER2_DAY2_TWO_DEAD = [
    "お願い～よ>>_seer2 >>_seer1 目を覚～ま～し～て～",
    "占い師死亡のお知らせ",
    "【悲報】占い師死亡www",
    "占い師がいないんじゃだれを吊ればいいかわからないじゃないか",
    "だれか占い師を生き返らせてくれーーーー",
    "誰吊る？",
    ">>_seer2 >>_seer1 死んでる",
    "お願い～よ>>_seer1 目を覚～ま～し～て～",
    "占い師がアタシ再生産してくれればよし",
    "スタァライトのオタクおって草",
    "スタァライトはいいぞ",
    "両方死ぬのやばすぎでしょ。占いに投票したやつ最悪だな",
]

SEER2_DAY2_ONE_DEAD_NO_RESULT = [
    "とりあえず、>>_seer_alive 占いの結果は?",
    ">>_seer_dead 死んでる。。。",
    ">>_seer_alive 占いの結果お願いします！",
    "_seer_aliveは生きてるのね。良かった。こっちが狂人だったら悲惨だけど",
]

SEER2_DAY2_ONE_DEAD_YES_RESULT = [
    "占い結果把握しやした",
    "口調が面白い奴いるw",
    ">>_target が_result なのね",
    "_target _result 把握です",
    "_targetが_result",
    "占い結果把握",
    "占い結果おけ",
    "占い結果了解いたした",
    "_target が_resultね。りょうかーい",
]

SEER2_DAY2_TWO_ALIVE_NO_RESULT = [
    "占い師両方生きてるの奇跡だ！！",
    "両占い師は結果の共有をお願いね",
]
SEER2_DAY2_TWO_ALIVE_TWO_RESULT = [
    "占い結果把握しました！",
]

SEER2_DAY2_TWO_ALIIVE_ONE_RESULT = [
    "もう片方の結果次第ってところかな？",
    "両方生き残ったのは奇跡でしょ！",
]
SEER2_DAY2_TWO_ALIE_NO_RESULT = [
    "とりあえず占いの結果を聞こうか",
    "占い結果はよ",
    "占い師生きているね。、よかった",
]

GRAY1 = [
    "グレーの_gray を吊ればよいと思います。占い結果からわかることは以上です",
    "グレランすればよいと思います。候補は_gray かな？",
]

GRAY2 = [
    "グレーが二人いて、_gray1, _gray2なのかな",
    "_gray1, _gray2を順に吊るのを希望",
    "グレランしようぜ",
    "グレーを吊ろう",
    "とりあえず、グレーを吊っていけばよいと思いますが",
    ">>_gray1と>>_gray2がグレーだけど、何かいうことある？",
]

GRAY3 = [
    "相互白だしか～～～。一番難しい局面だ",
    "占いCO以外の人をランダムに選択して吊るしかないかな",
    "私以外の誰かを吊ってくれ",
    "_gray を吊れ",
    "_gray吊り希望",
    "なんにもわからんけど....",
]

WHITE_CERTIFIED = [
    "_whiteは確定白か",
    "_white は確実に人間ってこと？",
    "_whiteは白だから他の人を吊ろうね",
]
